Revit 2027 API
ParameterTypeId.AnalyticalSolarHeatGainCoefficient Property
 "Solar Heat Gain Coefficient"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalSolarHeatGainCoefficient { get; }
Public Shared ReadOnly Property AnalyticalSolarHeatGainCoefficient As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalSolarHeatGainCoefficient {
	ForgeTypeId^ get ();
}
static member AnalyticalSolarHeatGainCoefficient : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace